# Задача 3

a = int(input('Введите число: '))
b = a + int(str(a)+str(a))+ int(str(a)+str(a)+str(a))
print(b)
