# Задача 3
#это из гитхаба
a = int(input('Введите число: '))
b = a + int(str(a)+str(a))+ int(str(a)+str(a)+str(a))
print(b)
